---
kind: method
id: M:Autodesk.Revit.DB.SynchronizeWithCentralOptions.Dispose
source: html/96380c66-ab5c-bae2-9871-58d3d38100c5.htm
---
# Autodesk.Revit.DB.SynchronizeWithCentralOptions.Dispose Method

Releases all resources used by the SynchronizeWithCentralOptions

## Syntax (C#)
```csharp
public void Dispose()
```